CSI API ETABS v1

# cFunctionRSSetNTC2018 Method

---

Defines a NTC 2018 response spectrum function

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int SetNTC2018(
    	string Name,
    	int ParamsOption,
    	double Latitude,
    	double Longitude,
    	int Island,
    	int LimitState,
    	int UsageClass,
    	double NomLife,
    	double PeakAccel,
    	double F0,
    	double Tcs,
    	int SpecType,
    	int SoilType,
    	int Topography,
    	double hRatio,
    	double Damping,
    	double q
    )

    Function SetNTC2018 (
    	Name As String,
    	ParamsOption As Integer,
    	Latitude As Double,
    	Longitude As Double,
    	Island As Integer,
    	LimitState As Integer,
    	UsageClass As Integer,
    	NomLife As Double,
    	PeakAccel As Double,
    	F0 As Double,
    	Tcs As Double,
    	SpecType As Integer,
    	SoilType As Integer,
    	Topography As Integer,
    	hRatio As Double,
    	Damping As Double,
    	q As Double
    ) As Integer

    Dim instance As cFunctionRS
    Dim Name As String
    Dim ParamsOption As Integer
    Dim Latitude As Double
    Dim Longitude As Double
    Dim Island As Integer
    Dim LimitState As Integer
    Dim UsageClass As Integer
    Dim NomLife As Double
    Dim PeakAccel As Double
    Dim F0 As Double
    Dim Tcs As Double
    Dim SpecType As Integer
    Dim SoilType As Integer
    Dim Topography As Integer
    Dim hRatio As Double
    Dim Damping As Double
    Dim q As Double
    Dim returnValue As Integer

    returnValue = instance.SetNTC2018(Name,
    	ParamsOption, Latitude, Longitude,
    	Island, LimitState, UsageClass, NomLife,
    	PeakAccel, F0, Tcs, SpecType, SoilType,
    	Topography, hRatio, Damping, q)

    int SetNTC2018(
    	String^ Name,
    	int ParamsOption,
    	double Latitude,
    	double Longitude,
    	int Island,
    	int LimitState,
    	int UsageClass,
    	double NomLife,
    	double PeakAccel,
    	double F0,
    	double Tcs,
    	int SpecType,
    	int SoilType,
    	int Topography,
    	double hRatio,
    	double Damping,
    	double q
    )

    abstract SetNTC2018 :
            Name : string *
            ParamsOption : int *
            Latitude : float *
            Longitude : float *
            Island : int *
            LimitState : int *
            UsageClass : int *
            NomLife : float *
            PeakAccel : float *
            F0 : float *
            Tcs : float *
            SpecType : int *
            SoilType : int *
            Topography : int *
            hRatio : float *
            Damping : float *
            q : float -> int

#### Parameters

Name

    Type: SystemString
The name of an existing or new function. If this is an existing function, that
function is modified; otherwise, a new function is added

ParamsOption

    Type: SystemInt32
This is 1, 2, or 3, indicating the option for defining the parameters

  1. by latitude and longitude
  2. by island
  3. user specified

Latitude

    Type: SystemDouble
The latitude for which the seismic coefficients are obtained. This item is
meaningful only when ParamsOption = 1

Longitude

    Type: SystemDouble
The longitude for which the seismic coefficients are obtained. This item is
meaningful only when ParamsOption = 1

Island

    Type: SystemInt32
This is one of the following values. This item is used only when ParamsOption
= 2

  1. Alicudi
  2. Arcipelago Toscano
  3. Filcudi
  4. Isole Egadi
  5. Lampedusa
  6. Linosa
  7. Lipari
  8. Palmarola
  9. Panarea
  10. Pantelleria
  11. Ponza
  12. Salina
  13. Santo Stefano
  14. Sardegna
  15. Stromboli
  16. Tremiti
  17. Ustica
  18. Ventotene
  19. Vulcano
  20. Zannone

LimitState

    Type: SystemInt32
This is 1, 2, 3, or 4, indicating the limit state

  1. SLO
  2. SLD
  3. SLV
  4. SLC

UsageClass

    Type: SystemInt32
This is 1, 2, 3, or 4, indicating the usage class

  1. I
  2. II
  3. III
  4. IV

NomLife

    Type: SystemDouble
The nominal life to be considered

PeakAccel

    Type: SystemDouble
The peak ground acceleration, ag/g

F0

    Type: SystemDouble
The magnitude factor

Tcs

    Type: SystemDouble
The reference period, Tc*[s]

SpecType

    Type: SystemInt32
This is 1, 2, 3, or 4, indicating the type of spectrum to consider

  1. Elastic horizontal
  2. Elastic vertical
  3. Design horizontal
  4. Design vertical

SoilType

    Type: SystemInt32
This is 1, 2, 3, 4, or 5, indicating the subsoil type

  1. A
  2. B
  3. C
  4. D
  5. E

Topography

    Type: SystemInt32
This is 1, 2, 3, or 4, indicating the topography type

  1. T1
  2. T2
  3. T3
  4. T4

hRatio

    Type: SystemDouble
The ratio for the site altitude at the base of the hill to the height of the
hill

Damping

    Type: SystemDouble
The damping, in percent. This is only applicable for SpecType 1 and 2

q

    Type: SystemDouble
The behavior correction factor. This is only applicable for SpecType 3 and 4

#### Return Value

Type: Int32
Returns zero if the function is successfully defined; otherwise it returns a
nonzero value

Remarks

Examples

VB

Copy

    Public Sub Example()

       'dimension variables
       Dim SapObject as cOAPI
       Dim SapModel As cSapModel
       Dim ret As Integer
       Dim ParamsOption As Integer
       Dim Latitude As Double
       Dim Longitude As Double
       Dim Island As Integer
       Dim LimitState As Integer
       Dim UsageClass As Integer
       Dim NomLife As Double
       Dim PeakAccel As Double
       Dim F0 As Double
       Dim Tcs As Double
       Dim SpecType As Integer
       Dim SoilType As Integer
       Dim Topography As Integer
       Dim hRatio As Double
       Dim Damping As Double
       Dim q As Double

       'create ETABS object
           Dim myHelper as cHelper = New Helper
           EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")

       'start ETABS application
           ret = EtabsObject.ApplicationStart()

       'create SapModel object
           SapModel = EtabsObject.SapModel

       'initialize model
           ret = SapModel.InitializeNewModel()

       'create steel deck template model
           ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)

       'add NTC 2018 RS function
           ret = SapModel.Func.FuncRS.SetNTC2018("RS-1", 1, 45.9, 12.6, 1, 3, 2, 50, 0.2, 2.4, 0.3, 3, 2, 1, 1, 5, 1)

       'get NTC 2018 RS function
           ret = SapModel.Func.FuncRS.GetNTC2018("RS-1", ParamsOption, Latitude, Longitude, Island, LimitState, UsageClass, NomLife, PeakAccel, F0, Tcs, SpecType, SoilType, Topography, hRatio, Damping, q)

       'close ETABS
           EtabsObject.ApplicationExit(False)

       'clean up variables
           SapModel = Nothing
           EtabsObject = Nothing
       End Sub

See Also

#### Reference

cFunctionRS Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com